In [15]:
import pandas as pd

In [16]:
data = {
    "Name" : ["Rutuja", "Anuj", "Yukta", "Sumit"],
    "Marks" : [65, 89, 70, 78]}

In [17]:
pd.DataFrame(data)

     Name  Marks
0  Rutuja     65
1    Anuj     89
2   Yukta     70
3   Sumit     78

In [18]:
##Dictonary to DataFrame
df = { "Name" : [1,2,3], "Marks" : [2,3,4] }

In [19]:
pd.DataFrame(df)

   Name  Marks
0     1      2
1     2      3
2     3      4

In [20]:
##Numpy arrays to DtaFrame
import numpy as np

arr = np.array([["Rutuja",2],["Anuj",4],["Sanika",6] ])

In [21]:
arr

array([['Rutuja', '2'],
       ['Anuj', '4'],
       ['Sanika', '6']], dtype='<U21')

In [22]:
pd.DataFrame(arr, columns = ["Name", "Id"])

     Name Id
0  Rutuja  2
1    Anuj  4
2  Sanika  6

In [23]:
import pandas as pd
pd.read_excel("data.xlsx")

      Name School  Marks
0   Rutuja    abc     46
1     Anuj    xyz     76
2     Yash    klm     89
3   Sanika    nop     90
4   Shreya    qrs     79
5    Ashok    tgf     76
6  Archana    kth     98

In [24]:
pd.read_csv("data.csv")

      Name School  Marks
0   Rutuja    abc     46
1     Anuj    xyz     76
2     Yash    klm     89
3   Sanika    nop     90
4   Shreya    qrs     79
5    Ashok    tgf     76
6  Archana    kth     98

In [25]:
pd.read_json("data.json")

     name         track
0  Rutuja  data science
1    Anuj       web dev

In [26]:
df = pd.read_csv("BMW_Car_Sales_Classification.csv")

In [27]:
df

,Model,Year,Region,Color,Fuel_Type,Transmission,Engine_Size_L,Mileage_KM,Price_USD,Sales_Volume,Sales_Classification
0,5 Series,2016,Asia,Red,Petrol,Manual,3.5,151748,98740,8300,High
1,i8,2013,North America,Red,Hybrid,Automatic,1.6,121671,79219,3428,Low
2,5 Series,2022,North America,Blue,Petrol,Automatic,4.5,10991,113265,6994,Low
3,X3,2024,Middle East,Blue,Petrol,Automatic,1.7,27255,60971,4047,Low
4,7 Series,2020,South America,Black,Diesel,Manual,2.1,122131,49898,3080,Low
...,...,...,...,...,...,...,...,...,...,...,...
49995,i3,2014,Asia,Red,Hybrid,Manual,4.6,151030,42932,8182,High
49996,i3,2023,Middle East,Silver,Electric,Manual,4.2,147396,48714,9816,High
49997,5 Series,2010,Middle East,Red,Petrol,Automatic,4.5,174939,46126,8280,High
49998,i3,2020,Asia,White,Electric,Automatic,3.8,3379,58566,9486,High
49999,X1,2020,North America,Blue,Diesel,Manual,3.3,171003,77492,1764,Low

In [28]:
df.head()

,Model,Year,Region,Color,Fuel_Type,Transmission,Engine_Size_L,Mileage_KM,Price_USD,Sales_Volume,Sales_Classification
0,5 Series,2016,Asia,Red,Petrol,Manual,3.5,151748,98740,8300,High
1,i8,2013,North America,Red,Hybrid,Automatic,1.6,121671,79219,3428,Low
2,5 Series,2022,North America,Blue,Petrol,Automatic,4.5,10991,113265,6994,Low
3,X3,2024,Middle East,Blue,Petrol,Automatic,1.7,27255,60971,4047,Low
4,7 Series,2020,South America,Black,Diesel,Manual,2.1,122131,49898,3080,Low

In [29]:
df.tail()

,Model,Year,Region,Color,Fuel_Type,Transmission,Engine_Size_L,Mileage_KM,Price_USD,Sales_Volume,Sales_Classification
49995,i3,2014,Asia,Red,Hybrid,Manual,4.6,151030,42932,8182,High
49996,i3,2023,Middle East,Silver,Electric,Manual,4.2,147396,48714,9816,High
49997,5 Series,2010,Middle East,Red,Petrol,Automatic,4.5,174939,46126,8280,High
49998,i3,2020,Asia,White,Electric,Automatic,3.8,3379,58566,9486,High
49999,X1,2020,North America,Blue,Diesel,Manual,3.3,171003,77492,1764,Low

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Model                 50000 non-null  object
 1   Year                  50000 non-null  int64
 2   Region                50000 non-null  object
 3   Color                 50000 non-null  object
 4   Fuel_Type             50000 non-null  object
 5   Transmission          50000 non-null  object
 6   Engine_Size_L         50000 non-null  float64
 7   Mileage_KM            50000 non-null  int64
 8   Price_USD             50000 non-null  int64
 9   Sales_Volume          50000 non-null  int64
 10  Sales_Classification  50000 non-null  object
dtypes: float64(1), int64(4), object(6)
memory usage: 4.2+ MB

In [31]:
df.describe()

               Year  Engine_Size_L     Mileage_KM      Price_USD  Sales_Volume
count  50000.000000   50000.000000   50000.000000   50000.000000  50000.000000
mean    2017.015700       3.247180  100307.203140   75034.600900   5067.514680
std        4.324459       1.009078   57941.509344   25998.248882   2856.767125
min     2010.000000       1.500000       3.000000   30000.000000    100.000000
25%     2013.000000       2.400000   50178.000000   52434.750000   2588.000000
50%     2017.000000       3.200000  100388.500000   75011.500000   5087.000000
75%     2021.000000       4.100000  150630.250000   97628.250000   7537.250000
max     2024.000000       5.000000  199996.000000  119998.000000   9999.000000

In [32]:
df.columns

Index(['Model', 'Year', 'Region', 'Color', 'Fuel_Type', 'Transmission',
       'Engine_Size_L', 'Mileage_KM', 'Price_USD', 'Sales_Volume',
       'Sales_Classification'],
      dtype='object')

In [33]:
df.shape

(50000, 11)

In [34]:
df['Model']

0        5 Series
1              i8
2        5 Series
3              X3
4        7 Series
           ...
49995          i3
49996          i3
49997    5 Series
49998          i3
49999          X1
Name: Model, Length: 50000, dtype: object

In [36]:
df['Year']

0        2016
1        2013
2        2022
3        2024
4        2020
         ...
49995    2014
49996    2023
49997    2010
49998    2020
49999    2020
Name: Year, Length: 50000, dtype: int64